/*
	 【問題14】
	 受験人数(1～9人)を入力させる。
	 各受験生の点数をランダムに発生させ、採点結果を一覧表示する。
	 点数は0~50とする。

	 【実行画面】
	 ■ 受験人数（1～9人）を入力してください：5

	 ------------------------------------------------------------
	 ■ 採点結果 一覧表
	 ------------------------------------------------------------
	 受験者1 |*********+*********+*********+***** 35点
	 受験者2 |*********+*********+***** 25点
	 受験者3 |*********+*********+*********+*********+***** 45点
	 受験者4 |*********+*********+*********+****** 36点
	 受験者5 |* 1点
	 ---------|---------+---------+---------+---------+---------+
	 0        10        20        30        40        50
	 */
import java.util.*;
public class Q014{
	public static void main(String[] args){
		System.out.print("受験人数(1～9人)を入力してください:");
		int student=new Scanner(System.in).nextInt();
		int score=-1,j=0;
		System.out.printf("------------------------------------------------------------%n    ■ 採点結果 一覧表%n------------------------------------------------------------%n");
		for(int i=0;i<student;i++){
			score=new Random().nextInt(50);
			System.out.printf("受験者%d |",i+1);
			for(j=0;j<score;j++){
				System.out.print((j+1)%10==0?"+":"*");
				if(j==score-1){
					System.out.printf(" %d点%n",score);
				}
			}
		}
		System.out.printf("--------|---------+---------+---------+---------+---------+%n        0        10        20        30        40        50");
	}
}
