/*
【問題14】
受験人数(1～9人)を入力させる。
各受験生の点数をランダムに発生させ、採点結果を一覧表示する。
点数は0~50とする。

【実行画面】
■ 受験人数（1～9人）を入力してください：5

------------------------------------------------------------
		■ 採点結果 一覧表
------------------------------------------------------------
 受験者1 |*********+*********+*********+***** 35点
 受験者2 |*********+*********+***** 25点
 受験者3 |*********+*********+*********+*********+***** 45点
 受験者4 |*********+*********+*********+****** 36点
 受験者5 |* 1点
---------|---------+---------+---------+---------+---------+
         0        10        20        30        40        50
*/
import java.util.*;
public class Q014{
	public static void main(String[] args){
		System.out.print("■受験人数(1~9人)を入力してください:");
		int input = new Scanner(System.in).nextInt();
		int[] scores = new int[input];
		for(int i=0;i<scores.length;i++){
			scores[i] = new Random().nextInt(50)+1;
		}
		//表を出力
		System.out.println("------------------------------------------------------------");
		System.out.println("		■ 採点結果 一覧表");
		System.out.println("------------------------------------------------------------");
		for(int i=0;i<scores.length;i++){
			System.out.printf(" 受験生%d |",i+1);
			for(int j=0;j<scores[i];j++){
				System.out.print(j%10 == 9 ? "+":"※");
			}
			System.out.println(" "+scores[i]+"点");
		}
		System.out.println("---------|---------+---------+---------+---------+---------+");
		System.out.println("         0        10        20        30        40        50");
	}
}
